Table of Contents
 Class StagesLoading
Namespace
IdeaRS.OpenModel.Concrete.Load
Assembly
IdeaRS.OpenModel.dll
Stages loading
public class StagesLoading : OpenObject
Inheritance
object
OpenObject
StagesLoading
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 StagesLoading()
Constructor
public StagesLoading()
Properties
 CssComponentLoad
Cross-section component loading
public List<CssComponentLoading> CssComponentLoad { get; set; }
Property Value
List<CssComponentLoading>
 CssEffectType
Type of effects in cross-section component
public CssEffectType CssEffectType { get; set; }
Property Value
CssEffectType
 PermanentLoad
Permanent loading
public List<StageLoading> PermanentLoad { get; set; }
Property Value
List<StageLoading>
 PrestressInputType
Type of input of prestressing
public PrestressInputType PrestressInputType { get; set; }
Property Value
PrestressInputType
 PrestressLoad
Prestress loading
public List<PrestressLoading> PrestressLoad { get; set; }
Property Value
List<PrestressLoading>
 TendonComponentLoad
Tendon component loading
public List<TendonComponentLoading> TendonComponentLoad { get; set; }
Property Value
List<TendonComponentLoading>
 Edit this page